In [5]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")
%matplotlib inline

In [6]:
df = pd.read_csv('My Uber Drives - 2016.csv')

In [7]:
df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1156 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

1. Our dataset have 1156 record rows and 7 columns
2. Among 15 columns 1 columns is of float datatype, 6 columns is of object datatype
3. Our dataset have one column which having null values.

In [9]:
df.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [10]:
df.columns=['START_DATE', 'END_DATE', 'CATEGORY', 'START', 'STOP', 'MILES',
       'PURPOSE']

In [11]:
df.isnull().sum()/len(df)*100

START_DATE     0.000000
END_DATE       0.086505
CATEGORY       0.086505
START          0.086505
STOP           0.086505
MILES          0.000000
PURPOSE       43.512111
dtype: float64

In [12]:
df.describe()

              MILES
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [13]:
df['PURPOSE'].unique()

array(['Meal/Entertain', nan, 'Errand/Supplies', 'Meeting',
       'Customer Visit', 'Temporary Site', 'Between Offices',
       'Charity ($)', 'Commute', 'Moving', 'Airport/Travel'], dtype=object)

In [14]:
df['PURPOSE'] = df['PURPOSE'].fillna('Not Known')

In [15]:
df.dropna(inplace=True)

In [16]:
df.reset_index(drop=True,inplace=True)

In [17]:
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,Not Known
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [18]:
catcol = df.select_dtypes(include='O').columns
catcol

Index(['START_DATE', 'END_DATE', 'CATEGORY', 'START', 'STOP', 'PURPOSE'], dtype='object')

In [19]:
df.sample(10)

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
899,11/3/2016 12:43,11/3/2016 12:49,Business,Hazelwood,Whitebridge,2.4,Not Known
1024,12/7/2016 12:03,12/7/2016 12:32,Business,Cary,Cary,6.6,Meeting
945,11/12/2016 13:46,11/12/2016 13:50,Business,Central,West Berkeley,0.6,Not Known
897,11/2/2016 17:53,11/2/2016 18:00,Business,Morrisville,Cary,3.8,Not Known
344,5/1/2016 14:26,5/1/2016 14:31,Business,Westpark Place,Whitebridge,2.3,Not Known
739,8/29/2016 18:27,8/29/2016 18:36,Business,Islamabad,Islamabad,2.6,Not Known
716,8/26/2016 14:10,8/26/2016 14:33,Business,Lahore,Lahore,7.4,Not Known
994,11/23/2016 16:18,11/23/2016 16:29,Business,Cary,Cary,1.9,Not Known
289,4/1/2016 13:43,4/1/2016 14:01,Business,Kissimmee,Kissimmee,11.0,Meeting
1046,12/12/2016 17:51,12/12/2016 18:01,Business,Cary,Morrisville,3.0,Meal/Entertain

In [20]:
df['START_DATE'] = pd.to_datetime(df['START_DATE'],format='%m/%d/%Y %H:%M')

In [21]:
df['END_DATE'] = pd.to_datetime(df['END_DATE'],format='%m/%d/%Y %H:%M')

In [22]:
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,Not Known
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [23]:
df['Month'] = df['START_DATE'].apply(lambda time:time.month)

In [24]:
df['Hour'] = df['START_DATE'].apply(lambda time:time.hour)

In [25]:
df['Weekday'] = df['START_DATE'].apply(lambda time:time.dayofweek)

In [26]:
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,1,21,4
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,Not Known,1,1,5
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,1,20,5
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,1,17,1
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,1,14,2

In [27]:
dmap = {0:'Mon',1:'Tues',2:'Wed',3:'Thur',4:'Fri',5:'Sat',6:'Sun'}

In [28]:
df['Weekday'] = df['Weekday'].map(dmap)

In [29]:
df.sample(5)

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday
859,2016-10-25 22:24:00,2016-10-25 22:45:00,Business,Parkway,Whitebridge,8.7,Errand/Supplies,10,22,Tues
899,2016-11-03 12:43:00,2016-11-03 12:49:00,Business,Hazelwood,Whitebridge,2.4,Not Known,11,12,Thur
1079,2016-12-21 07:42:00,2016-12-21 08:10:00,Business,Unknown Location,Unknown Location,11.5,Meeting,12,7,Wed
399,2016-06-03 19:36:00,2016-06-03 19:42:00,Business,Huntington Woods,Weston,1.7,Errand/Supplies,6,19,Fri
249,2016-03-19 17:52:00,2016-03-19 18:00:00,Business,Port Bolivar,Port Bolivar,1.2,Not Known,3,17,Sat

In [30]:
mmap = {1:'Jan',2:'Feb',3:'Mar',4:'Apr',5:'May',6:'Jun',7:'July',8:'Aug',9:'Sep',10:'Oct',11:'Nov',12:'Dec'}

In [31]:
df['Month'] = df['Month'].map(mmap)

In [32]:
df.sample(5)

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday
723,2016-08-27 09:34:00,2016-08-27 10:11:00,Business,Unknown Location,Lahore,9.6,Not Known,Aug,9,Sat
638,2016-08-08 17:02:00,2016-08-08 17:13:00,Business,Edgehill Farms,Whitebridge,2.7,Customer Visit,Aug,17,Mon
621,2016-08-02 11:51:00,2016-08-02 12:15:00,Business,Arlington,Washington,4.9,Not Known,Aug,11,Tues
700,2016-08-23 12:59:00,2016-08-23 13:15:00,Business,Unknown Location,Noorpur Shahan,7.7,Not Known,Aug,12,Tues
771,2016-09-24 14:34:00,2016-09-24 15:15:00,Business,Karachi,Unknown Location,8.2,Not Known,Sep,14,Sat

In [33]:
df['Duration'] = df['END_DATE'] - df['START_DATE']

In [34]:
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Jan,21,Fri,0 days 00:06:00
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,Not Known,Jan,1,Sat,0 days 00:12:00
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Jan,20,Sat,0 days 00:13:00
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Jan,17,Tues,0 days 00:14:00
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Jan,14,Wed,0 days 01:07:00

In [35]:
df['Duration'] = df['Duration'].astype('str')

In [36]:
df['Duration'] = df['Duration'].map(lambda x:x[7:])

In [37]:
df.sample(5)

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
1019,2016-12-03 20:31:00,2016-12-03 20:41:00,Business,Morrisville,Cary,3.0,Customer Visit,Dec,20,Sat,00:10:00
400,2016-06-03 22:47:00,2016-06-03 23:06:00,Business,Morrisville,Cary,4.0,Between Offices,Jun,22,Fri,00:19:00
440,2016-06-14 16:09:00,2016-06-14 16:39:00,Business,San Francisco,Emeryville,11.6,Meeting,Jun,16,Tues,00:30:00
51,2016-01-28 15:11:00,2016-01-28 15:31:00,Business,Meredith Townes,Leesville Hollow,14.7,Meeting,Jan,15,Thur,00:20:00
528,2016-07-08 10:51:00,2016-07-08 11:12:00,Business,Pontchartrain Beach,CBD,7.0,Not Known,July,10,Fri,00:21:00

# 1. Find Rides which covered maximum, minimum miles

In [51]:
maximum = (df['MILES'].max())
df[df['MILES'] == maximum]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
269,2016-03-25 16:52:00,2016-03-25 22:22:00,Business,Latta,Jacksonville,310.3,Customer Visit,Mar,16,Fri,05:30:00

maximum ride Duration is 5 hours and 30 minutes.Ride Start to Latta and End to Jacksonville.
maximum ride highest travel distance are 310.3 miles.

In [39]:
minimum = (df['MILES'].min())
df[df['MILES'] == minimum]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
44,2016-01-26 17:27:00,2016-01-26 17:29:00,Business,Cary,Cary,0.5,Errand/Supplies,Jan,17,Tues,00:02:00
120,2016-02-17 16:38:00,2016-02-17 16:43:00,Business,Katunayaka,Katunayaka,0.5,Errand/Supplies,Feb,16,Wed,00:05:00
420,2016-06-08 17:16:00,2016-06-08 17:18:00,Business,Soho,Tribeca,0.5,Errand/Supplies,Jun,17,Wed,00:02:00

In our data higest travel distance is 0.5 miles.
minimum travel distance their are 3 records and this belongs to business category.

#

# 2. Rides maximum and minimum according to Duration.

In [40]:
max_d = (df['Duration'].max())
df[df['Duration'] == max_d]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
776,2016-09-27 21:01:00,2016-09-28 02:37:00,Business,Unknown Location,Unknown Location,195.6,Not Known,Sep,21,Tues,05:36:00

In our data higest travel duration is 5 hours 36 minutes.

In [41]:
min_d = (df['Duration'].min())
df[df['Duration'] == min_d]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,Month,Hour,Weekday,Duration
751,2016-09-06 17:49:00,2016-09-06 17:49:00,Business,Unknown Location,Unknown Location,69.1,Not Known,Sep,17,Tues,00:00:00
761,2016-09-16 07:08:00,2016-09-16 07:08:00,Business,Unknown Location,Unknown Location,1.6,Not Known,Sep,7,Fri,00:00:00
798,2016-10-08 15:03:00,2016-10-08 15:03:00,Business,Karachi,Karachi,3.6,Not Known,Oct,15,Sat,00:00:00
807,2016-10-13 13:02:00,2016-10-13 13:02:00,Business,Islamabad,Islamabad,0.7,Not Known,Oct,13,Thur,00:00:00

In our data higest travel duration is 0 hours 0 minutes.

#

# 3. Rides per Month.

In [42]:
df['Month'].value_counts()

Dec     146
Aug     133
Nov     122
Feb     115
Mar     113
July    112
Jun     108
Oct     106
Jan      61
Apr      54
May      49
Sep      36
Name: Month, dtype: int64

In Dec Month maximum people are travel.
In sep month less people are travel

#

# 4. Rides per hour.

In [53]:
df['Hour'].value_counts()

15    98
17    95
13    94
18    94
14    89
16    88
12    77
11    72
20    71
19    68
10    65
9     51
21    51
8     35
22    31
23    26
0     19
7     13
1      5
5      4
6      4
3      3
2      2
Name: Hour, dtype: int64

In maximum people are traveled 15 hours and their are 98 records are present in Dataset. 
In minimum people are traveled 2 hours and their are 2 records are present in Dataset.

#

# 5. Rides per purpose

In [54]:
df['PURPOSE'].value_counts()

Not Known          502
Meeting            187
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Charity ($)          1
Commute              1
Name: PURPOSE, dtype: int64

The 502 people are Ride for not known.

#

# 6 Rides Per Category and Per Purpose

In [59]:
df.groupby(df['CATEGORY'])['PURPOSE'].value_counts()

CATEGORY  PURPOSE
Business  Not Known          431
          Meeting            187
          Meal/Entertain     160
          Errand/Supplies    128
          Customer Visit     101
          Temporary Site      50
          Between Offices     18
          Airport/Travel       3
Personal  Not Known           71
          Moving               4
          Charity ($)          1
          Commute              1
Name: PURPOSE, dtype: int64

In business category maximum people traveled in not known and Minium people in Airport travel.
In Personal category maximum people traveled in not known and only one for commute.

#

# 7.Busiest day

In [69]:
df["Weekday"].value_counts()

Fri     206
Tues    176
Mon     174
Thur    154
Sat     150
Sun     148
Wed     147
Name: Weekday, dtype: int64

In Friday maximum people are travel so Friday is Busy day.

#

# 8.Top 5 LOcation Start and Stop

In [49]:
df['START'].value_counts().head(5)

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Name: START, dtype: int64

In [50]:
df['STOP'].value_counts().head(5)

Cary                203
Unknown Location    149
Morrisville          84
Whitebridge          65
Islamabad            58
Name: STOP, dtype: int64

The mostly people are Start to travel Cary and Stop  to cary.